pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxAgbt_regdef.h
/** \brief Physical layer Control Register 2 */
typedef struct _Ifx_AGBT_PYCR2_Bits
{
    Ifx_UReg_32Bit reserved_0:4;      /**< \brief [3:0] \internal Reserved */
    Ifx_UReg_32Bit TXLDOVS:3;         /**< \brief [6:4] TXLDOVS - TXLDOVS (rw) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit TXOCDSLE:5;        /**< \brief [12:8] TXOCDSLE - TXOCDSLE (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit TXOCDSL:3;         /**< \brief [18:16] TXOCDSL - TXOCDSL (rw) */
    Ifx_UReg_32Bit TXDEEMPH:1;        /**< \brief [19:19] TXDEEMPH - TXDEEMPH (rw) */
    Ifx_UReg_32Bit TXSERRST:1;        /**< \brief [20:20] TXSERRST - TXSERRST (rwh) */
    Ifx_UReg_32Bit reserved_21:1;     /**< \brief [21:21] \internal Reserved */
    Ifx_UReg_32Bit CKRXDIV2:1;        /**< \brief [22:22] CKRXDIV2 - CKRXDIV2 (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit CKRXTERM:3;        /**< \brief [26:24] CKRXTERM - CKRXTERM (rw) */
    Ifx_UReg_32Bit TXSRINVC:1;        /**< \brief [27:27] TXSRINVC - TXSRINVC (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_AGBT_PYCR2_Bits;

/** \brief Trace Auto Channel UP */
typedef struct _Ifx_AGBT_TACU_Bits
{
    Ifx_UReg_32Bit ACIC:31;           /**< \brief [30:0] Automatic Channel Initialization Counter - ACIC (rw) */
    Ifx_UReg_32Bit ACIEN:1;           /**< \brief [31:31] Automatic Channel Initialization enable - ACIEN (rw) */
} Ifx_AGBT_TACU_Bits;

/** \brief Trace Control Register */
typedef struct _Ifx_AGBT_TCR_Bits
{
    Ifx_UReg_32Bit TE:1;              /**< \brief [0:0] Trace Enable - TE (rwh) */
    Ifx_UReg_32Bit PLLE:1;            /**< \brief [1:1] PLL reset - PLLE (rw) */
    Ifx_UReg_32Bit TXA:1;             /**< \brief [2:2] Initialized - TXA (rwh) */
    Ifx_UReg_32Bit PON:1;             /**< \brief [3:3] Power On - PON (rw) */
    Ifx_UReg_32Bit TPV:1;             /**< \brief [4:4] Trace Port Verified - TPV (rwh) */
    Ifx_UReg_32Bit BD:3;              /**< \brief [7:5] Baud rate selection/availability - BD (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit AGBTON:1;          /**< \brief [16:16] AGBT on - AGBTON (rw) */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit CRCON:1;           /**< \brief [18:18] CRC append at the end of a data block on. - CRCON (rw) */
    Ifx_UReg_32Bit ATPMON:1;          /**< \brief [19:19] Aurora Test Pattern Mode - ATPMON (rw) */
    Ifx_UReg_32Bit ARDT:2;            /**< \brief [21:20] ADAS Raw Data Transfer - ARDT (rw) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_AGBT_TCR_Bits;

/** \brief Trace Status Register */
typedef struct _Ifx_AGBT_TSR_Bits
{
    Ifx_UReg_32Bit TXLNUP:1;          /**< \brief [0:0] TX lane up - TXLNUP (rh) */
    Ifx_UReg_32Bit FBE:1;             /**< \brief [1:1] FIFO Buffer empty indication - FBE (rh) */
    Ifx_UReg_32Bit PLK:1;             /**< \brief [2:2] PLL lock status - PLK (rh) */
    Ifx_UReg_32Bit ATBS:2;            /**< \brief [4:3] AGBT Trace Buffer Size - ATBS (rh) */
    Ifx_UReg_32Bit reserved_5:26;     /**< \brief [30:5] \internal Reserved */
    Ifx_UReg_32Bit CHUP:1;            /**< \brief [31:31] Channel up - CHUP (rh) */
} Ifx_AGBT_TSR_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_agbt_Registers_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_ACCEN0_Bits B;           /**< \brief Bitfield access */
} Ifx_AGBT_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_ACCEN1_Bits B;           /**< \brief Bitfield access */
} Ifx_AGBT_ACCEN1;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_CLC_Bits B;              /**< \brief Bitfield access */
} Ifx_AGBT_CLC;

/** \brief FIFO Block Fill Level   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_FBFLV_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_FBFLV;

/** \brief FIFO Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_FCTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_FCTRL;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_ID_Bits B;               /**< \brief Bitfield access */
} Ifx_AGBT_ID;

/** \brief Interrupt enable register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_IRE_Bits B;              /**< \brief Bitfield access */
} Ifx_AGBT_IRE;

/** \brief Interrupt Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_IRS_Bits B;              /**< \brief Bitfield access */
} Ifx_AGBT_IRS;

/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_KRST0_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_KRST1_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_KRSTCLR_Bits B;          /**< \brief Bitfield access */
} Ifx_AGBT_KRSTCLR;

